In [63]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [64]:
import statistics

In [65]:
df=pd.read_csv(r'C:\Users\Preethy\Downloads\StudentsPerformance.csv')

In [66]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [67]:

# 1. Find out how many males and females participated in the test.

In [68]:
count_female=df['gender']=="male"
count_female.sum()

482

In [69]:
count_male=df['gender']=="female"
count_male.sum()

518

In [70]:
#2. What do you think about the students' parental level of education

In [71]:
df1 = df.groupby(['gender','parental level of education'])[['reading score', 'math score', 'writing score']].mean()

In [72]:
df1

                                    reading score  math score  writing score
gender parental level of education
female associate's degree               74.120690   65.250000      74.000000
       bachelor's degree                77.285714   68.158730      78.380952
       high school                      68.202128   58.840426      66.691489
       master's degree                  76.805556   66.500000      77.638889
       some college                     73.550847   65.186441      74.050847
       some high school                 69.010989   58.780220      68.285714
male   associate's degree               67.622642   70.962264      65.688679
       bachelor's degree                68.090909   70.581818      67.654545
       high school                      61.284314   64.568627      58.450980
       master's degree                  74.608696   76.130435      72.608696
       some college                     65.212963   69.250000      63.555556
       some high school                 64.431818   67.636364      61.375000

In [73]:
# Among students with same parental level of education, females have more reading and writing score when compared to males,whereas males have more math score when compared to females

In [74]:
# 3.Who scores the most on average for math, reading and writing based on
# Gender
# Test preparation course

In [75]:
df2 = df.groupby(['gender','test preparation course'])[['reading score', 'math score', 'writing score']].mean()

In [76]:
df2

                                reading score  math score  writing score
gender test preparation course
female completed                    77.375000   67.108696      78.793478
       none                         69.955090   61.320359      68.982036
male   completed                    70.793103   72.988506      70.339080
       none                         62.581169   66.467532      59.551948

In [77]:
# females who have completed test preparation course has scored more in reading and writing when compared to males whereas males who have completed test preparation course has scored more in maths.

In [78]:
#4. What do you think about the scoring variation for math, reading and writing based on
# Gender
# Test preparation course

In [79]:
df3 = df.groupby(['gender','test preparation course'])[['reading score', 'math score', 'writing score']].var()

In [80]:
df3

                                reading score  math score  writing score
gender test preparation course
female completed                   161.175546  208.173913     149.836897
       none                        214.241220  272.602767     225.495172
male   completed                   185.297987  197.098133     166.098233
       none                        184.843553  205.513600     181.394687

In [81]:
#females who have not completed test preparation course has more scoring variation in math,reading and writing when compared to males

In [82]:
#5.The management needs your help to give bonus points to the top 25% ostudents based on their math score, so how will you help the managementto achieve this.

In [83]:
df.describe()

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     66.001000      69.195000      68.119000
std      15.569567      14.706436      15.226381
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      58.000000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.250000      79.000000
max     100.000000     100.000000     100.000000